In [1]:
# 쥬피터노트북 셀 스타일 조절 
from IPython.core.display import display, HTML
display(HTML("<style>.container { font-weight: bold !important; }</style>"))
display(HTML("<style>.container { width: 100% !important; }</style>"))

# 경고 메세지 숨기기 
import warnings
warnings.filterwarnings(action='ignore')

In [2]:
import pandas as pd
import numpy as np

# 결측값 처리 

```
np.nan : 넘파이 결측값 

NaN = Not A Number

아무것도 없다. 누락값. 결측치 

isnull() : 결측값이 있는 경우 True
notnull() : 결측값이 없는 경우 True

시리즈변수.isnull()
데이타프레임[컬럼명].isnull()
isnull().sum(), isnull().count() 결측값의 갯수

결측값이 있는 데이타 조회
데이타프레임.loc[데이타프레임.isnull()[NaN값이 있는 열], :]

```

In [3]:
# 결측값이 있는 시리즈 생성 
s1 = pd.Series([np.nan, 10, 200, np.nan,  -7, np.nan, 0])
s1

0      NaN
1     10.0
2    200.0
3      NaN
4     -7.0
5      NaN
6      0.0
dtype: float64

In [4]:
# NaN 은 True 반환 
s1.isnull()

0     True
1    False
2    False
3     True
4    False
5     True
6    False
dtype: bool

In [6]:
# NaN 은 False 반환 
s1.notnull()

0    False
1     True
2     True
3    False
4     True
5    False
6     True
dtype: bool

In [8]:
# 결측치의 갯수는?
s1.isnull().sum()

3

In [9]:
# 결측치가 아니것의 갯수는?
s1.notnull().sum(), s1.count()

(4, 4)

In [11]:
# 결측값이 있는 데이타프레임 생성 
df = pd.DataFrame(np.arange(1,21).reshape(5,4))
df.index = ['row'+str(i) for i in range(1,6)]
df.columns = ['col'+str(i) for i in range(1,5)]
# 결측치 값 강제적으로 삽입 
df.loc['row1','col2'] = np.nan
df.loc['row4','col1'] = np.nan
df.loc['row5','col4'] = np.nan
df.iloc[1,2] = np.nan
df

      col1  col2  col3  col4
row1   1.0   NaN   3.0   4.0
row2   5.0   6.0   NaN   8.0
row3   9.0  10.0  11.0  12.0
row4   NaN  14.0  15.0  16.0
row5  17.0  18.0  19.0   NaN

In [12]:
# 결측치가 있는 데이타는 True 
df.isnull()

       col1   col2   col3   col4
row1  False   True  False  False
row2  False  False   True  False
row3  False  False  False  False
row4   True  False  False  False
row5  False  False  False   True

In [13]:
# 각 컬럼의 결측치가 표시 
df.isnull().sum()

col1    1
col2    1
col3    1
col4    1
dtype: int64

In [14]:
# 결측치가 있는 데이타 조회 
df.loc[df.isnull()['col1'], :]

      col1  col2  col3  col4
row4   NaN  14.0  15.0  16.0

In [16]:
df[df.isnull()['col1']]

      col1  col2  col3  col4
row4   NaN  14.0  15.0  16.0

# NaN 값이 들어있는 행 삭제하기
- 데이타프레임이름.dropna(how="any",  inplace=False/True) : 결측값이 하나라도 있다면 삭제 
- 데이타프레임이름.dropna(how="all",  inplace=False/True) : 결측값이 모두 있다면 삭제

In [17]:
# 결측값이 있는 데이타프레임 생성 
df = pd.DataFrame(np.arange(1,21).reshape(5,4))
df.index = ['row'+str(i) for i in range(1,6)]
df.columns = ['col'+str(i) for i in range(1,5)]
df.loc['row1','col2'] = np.nan
df.loc['row4','col1'] = np.nan
df.loc['row5','col1'] = np.nan
df.loc['row5','col2'] = np.nan
df.loc['row5','col3'] = np.nan
df.loc['row5','col4'] = np.nan
df

      col1  col2  col3  col4
row1   1.0   NaN   3.0   4.0
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   NaN  14.0  15.0  16.0
row5   NaN   NaN   NaN   NaN

In [18]:
# 하나라도 결측치가 있다면 삭제 
df.dropna(how="any")

      col1  col2  col3  col4
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0

In [19]:
df

      col1  col2  col3  col4
row1   1.0   NaN   3.0   4.0
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   NaN  14.0  15.0  16.0
row5   NaN   NaN   NaN   NaN

In [21]:
# 모든 행의 값이 결측치
df.dropna(how="all", inplace=True)

In [22]:
df

      col1  col2  col3  col4
row1   1.0   NaN   3.0   4.0
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   NaN  14.0  15.0  16.0

# NaN값에 특정 값 입력하기

데이타프레임이름.fillna(value=값)

In [23]:
# 결측값이 있는 데이타프레임 생성 
df = pd.DataFrame(np.arange(1,21).reshape(5,4))
df.index = ['row'+str(i) for i in range(1,6)]
df.columns = ['col'+str(i) for i in range(1,5)]
df.loc['row1','col2'] = np.nan
df.loc['row4','col1'] = np.nan
df.loc['row5','col1'] = np.nan
df.loc['row5','col2'] = np.nan
df.loc['row5','col3'] = np.nan
df.loc['row5','col4'] = np.nan
df

      col1  col2  col3  col4
row1   1.0   NaN   3.0   4.0
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   NaN  14.0  15.0  16.0
row5   NaN   NaN   NaN   NaN

In [24]:
df.fillna(0)

      col1  col2  col3  col4
row1   1.0   0.0   3.0   4.0
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   0.0  14.0  15.0  16.0
row5   0.0   0.0   0.0   0.0

In [25]:
df

      col1  col2  col3  col4
row1   1.0   NaN   3.0   4.0
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   NaN  14.0  15.0  16.0
row5   NaN   NaN   NaN   NaN

In [28]:
# 평균값으로 결측치 채우기 
df.fillna(df.mean(), inplace=True)

In [29]:
df

      col1  col2  col3  col4
row1   1.0  10.0   3.0   4.0
row2   5.0   6.0   7.0   8.0
row3   9.0  10.0  11.0  12.0
row4   5.0  14.0  15.0  16.0
row5   5.0  10.0   9.0  10.0